#!/usr/bin/env python
#-*- coding:utf-8 -*-

# 集合中的元素不能重复，且没有下标，不支持切片操作，元素不能包括列表及集合
# 因为列表和集合都可以通过一些方法向里面删除、添加元素
# {32, '11', 5, 'c', '32'}
# s1 = {32, 5, 'c', '32', '11'}
# print(s1)

# {32, '46', '32', 'aa'}
# s2 = set({32, '46', '32', 'aa'})
# print(s2)

# {',', '4', '1', '6', '2', '3'}
# s3 = set('4,32,46,11,32')
# print(s3)


# 判断运算 in    not in 可以用来判断元素是否存在集合中，返回值是True和False
# 32 in s3
# 4 not in s3

# 集合与字符串、列表、元组的互转  set(str[list][tuple])
# 常用操作：len(set)  add(obj)  set.remove(obj)  set.pop()随机删除元素
# 常用运算：&交集 |并集 -差集 ……补集
# 集合与字符串、列表、元组一样，可以使用for循环遍历

set1 = {"abc", "xyz", "123", ("a", "b"), 123}
for i in set1:
    print(i)
# xyz 123 ('a', 'b') abc 123




